scripts/singlePhase/base/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;

    // transportModel  Newtonian;


//phases (phase1 phase2);
//
//phase1
//{
    //transportModel  Newtonian;
    //nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    //rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
//}
//
//
//phase2
//{
    //transportModel  Newtonian;
    //nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
    //rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
//}



//sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.00;
//theta           theta [ 0 0 0 0 0 0 0 ] 0; //used in calcPcAvg this value will be overwritten by scripts


// ************************************************************************* //
